XPPGX/STM32f746G_Discovery_UART/Src/main.c
  /*Configure GPIO pins : LCD_SCL_Pin LCD_SDA_Pin */
  GPIO_InitStruct.Pin = LCD_SCL_Pin|LCD_SDA_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C3;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);
  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_PWM_D6_Pin */
  GPIO_InitStruct.Pin = ARDUINO_PWM_D6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_TIM12;
  HAL_GPIO_Init(ARDUINO_PWM_D6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_MISO_D12_Pin ARDUINO_MOSI_PWM_D11_Pin */
  GPIO_InitStruct.Pin = ARDUINO_MISO_D12_Pin|ARDUINO_MOSI_PWM_D11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 4, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */
int fputc(int ch, FILE *f)
	{
		HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xFFFF);
		return ch;
	}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
	if(GPIO_Pin == GPIO_PIN_11){
		switch (mode_count){
			case 0:
				led_count = 0;
				HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1);
				BSP_LCD_Clear(LCD_COLOR_BLACK);
				BSP_LCD_DisplayStringAt(10,10,(uint8_t*)"MODE 1, LED FLASH = 5Hz",CENTER_MODE);
				printf("MODE 1, LED FLASH = 5Hz\r\n");
				mode_count = mode_count + 1;
				led = 1;
				break;
			case 1:
				led_count = 0;
				HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1);
				BSP_LCD_Clear(LCD_COLOR_BLACK);
				BSP_LCD_DisplayStringAt(10,10,(uint8_t*)"MODE 2, LED FLASH = 1Hz",CENTER_MODE);
				printf("MODE 2, LED FLASH = 1Hz\r\n");
				mode_count = mode_count + 1;
				led = 2;
				break;
			case 2:
				HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1);
				BSP_LCD_Clear(LCD_COLOR_BLACK);
				BSP_LCD_DisplayStringAt(10,10,(uint8_t*)"MODE 3, LED FLASH = 0",CENTER_MODE);
				printf("MODE 3, LED FLASH = 0\r\n");
				mode_count = 0;
				led = 3;
				break;
		}
	}
}
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
 //HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1);
 switch(led){
	 case 1:
		 HAL_GPIO_WritePin(GPIOI,GPIO_PIN_1,GPIO_PIN_RESET);
		 led_count = led_count + 1;
		 if(led_count == 4){
			HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1);
			led_count = 0;
		 }
		 break;
	 case 2:
		 led_count = led_count + 1;
		 if(led_count == 10){
				HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1);
				led_count = 0;
		 }
		 break;
	 case 3:
		 //HAL_GPIO_WritePin(GPIOI,GPIO_PIN_1,GPIO_PIN_RESET);
		HAL_GPIO_TogglePin(GPIOI,GPIO_PIN_1); 
		break;
 }
	
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
